/*реализовать классы следующих геометрических фигур: 
1.Треугольник 
2.Прямоугольник 
3.Квадрат 
4.Круг 
У каждой из этих фигур реализовать методы вычисления периметра и площади этих фигур. 
Так же для каждой фигуры реализовать проверку на корректность данных при создании фигуры, 
то есть можем ли мы начертить такой треугольник с заданными стонами или квадрат или прямоугольник. 
Так же круг может существовать только с радиусом больше нуля. 
Использовать эти классы в main и проверить все методы и конструкторы классов."
*/
package lec2_oop;

public class Program {
    public static void main(String[] args) {

        Circle circle = new Circle();
    }

}
